In [65]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

plt.rcParams['figure.figsize'] = (16, 5)

In [66]:
data = pd.read_csv('Mall_Customers.csv')
data

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [67]:
data.columns = ['CustomerID','Gender', 'Age', 'AnnualIncome','SpendingScore']

data

     CustomerID  Gender  Age  AnnualIncome  SpendingScore
0             1    Male   19            15             39
1             2    Male   21            15             81
2             3  Female   20            16              6
3             4  Female   23            16             77
4             5  Female   31            17             40
..          ...     ...  ...           ...            ...
195         196  Female   35           120             79
196         197  Female   45           126             28
197         198    Male   32           126             74
198         199    Male   32           137             18
199         200    Male   30           137             83

[200 rows x 5 columns]

### Divide Age into Discrete Categories

In [68]:
print(data['Age'].min())
print(data['Age'].max())

18
70

In [69]:
def age(x):
    if x <= 24:
        return "Young"
    elif 25<= x <=40:
        return "Adult"
    else:
        return "Old"
    
data['Age'] = data['Age'].apply(age)
data['Age'].value_counts()

Adult    87
Old      78
Young    35
Name: Age, dtype: int64

### Understand the Impact of Spending score on Different Age Groups

In [70]:
data[['Age', 'SpendingScore']].groupby(['Age']).agg(['min','mean','max'])

      SpendingScore
                min       mean max
Age
Adult             1  60.517241  99
Old               3  35.974359  60
Young             5  56.257143  94

In [71]:
data[['Age', 'AnnualIncome']].groupby(['Age']).agg(['min','mean','max'])

      AnnualIncome
               min       mean  max
Age
Adult           17  68.712644  137
Old             19  58.602564  126
Young           15  44.657143   81

### Find out the Top 10 Target Customers

In [72]:
data[['AnnualIncome','SpendingScore']].head()

   AnnualIncome  SpendingScore
0            15             39
1            15             81
2            16              6
3            16             77
4            17             40

In [79]:
data[['CustomerID','AnnualIncome','SpendingScore']][(data['AnnualIncome'] > 80)
        & (data['SpendingScore'] > 85)].sort_values(by = 'SpendingScore', ascending = False).head(10)

     CustomerID  AnnualIncome  SpendingScore
185         186            99             97
167         168            86             95
163         164            81             93
173         174            87             92
193         194           113             91
179         180            93             90
183         184            98             88
175         176            88             86
181         182            97             86